In [1]:
import pandas as pd

In [2]:
fruit_price = pd.DataFrame({'name': ['Apple', 'Banana', 'Orange', 'Watermelon', 'Plum', 'Blueberries', 'Dragonfruit', 'Kiwi'], 'price_usd': [0.88, 0.23, 0.68, 3.98, 0.96, 5.16, 5.27, 1.12]})
fruit_price

          name  price_usd
0        Apple       0.88
1       Banana       0.23
2       Orange       0.68
3   Watermelon       3.98
4         Plum       0.96
5  Blueberries       5.16
6  Dragonfruit       5.27
7         Kiwi       1.12

In [4]:
fruit_price['name'].str.lower()

0          apple
1         banana
2         orange
3     watermelon
4           plum
5    blueberries
6    dragonfruit
7           kiwi
Name: name, dtype: object

In [5]:
fruit_price['name'] = fruit_price['name'].str.lower()
fruit_price

          name  price_usd
0        apple       0.88
1       banana       0.23
2       orange       0.68
3   watermelon       3.98
4         plum       0.96
5  blueberries       5.16
6  dragonfruit       5.27
7         kiwi       1.12

In [7]:
movies = pd.DataFrame({
    'movie_title': ['The sumif all fears', 'The seaborn identity', 'The matrices',
                    "There's something about merging", 'Mamma median!', 'Hrry Plotter',
                    'Kung Fu Pandas', 'While you were sorting', '10 Things i hate about unix'],
    'movie_genre': ['Action', 'Action', 'Action', 'Comedy', 'Comedy', 'Kids', 'Kids', 'Romance', 'Romance'],
    'movie_length': [124, 119, 136, 119, 108, 159, 92, 103, 97]
})

In [8]:
movies.movie_title

0                The sumif all fears
1               The seaborn identity
2                       The matrices
3    There's something about merging
4                      Mamma median!
5                       Hrry Plotter
6                     Kung Fu Pandas
7             While you were sorting
8        10 Things i hate about unix
Name: movie_title, dtype: object

In [9]:
movies['movie_title'] = movies['movie_title'].str.lower()
movies

                       movie_title movie_genre  movie_length
0              the sumif all fears      Action           124
1             the seaborn identity      Action           119
2                     the matrices      Action           136
3  there's something about merging      Comedy           119
4                    mamma median!      Comedy           108
5                     hrry plotter        Kids           159
6                   kung fu pandas        Kids            92
7           while you were sorting     Romance           103
8      10 things i hate about unix     Romance            97